## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 11 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                    RESOURCE                                    |
|--------|--------------------------------------------------------------------------------|
| add    | `module.schedule_shutdown[0].aws_cloudwatch_event_rule.schedule[&quot;shutdown&quot;]`   |
|        | `module.schedule_shutdown[0].aws_cloudwatch_event_rule.schedule[&quot;startup&quot;]`    |
|        | `module.schedule_shutdown[0].aws_cloudwatch_event_target.schedule[&quot;shutdown&quot;]` |
|        | `module.schedule_shutdown[0].aws_cloudwatch_event_target.schedule[&quot;startup&quot;]`  |
|        | `module.schedule_shutdown[0].aws_cloudwatch_log_group.schedule`                |
|        | `module.schedule_shutdown[0].aws_iam_policy.schedule`                          |
|        | `module.schedule_shutdown[0].aws_iam_role.schedule`                            |
|        | `module.schedule_shutdown[0].aws_iam_role_policy_attachment.schedule`          |
|        | `module.schedule_shutdown[0].aws_lambda_function.schedule`                     |
|        | `module.schedule_shutdown[0].aws_lambda_permission.schedule[&quot;shutdown&quot;]`       |
|        | `module.schedule_shutdown[0].aws_lambda_permission.schedule[&quot;startup&quot;]`        |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.schedule_shutdown[0].data.aws_iam_policy_document.cloudwatch_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cloudwatch_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "CloudWatchAccess"
        }
    }

  # module.schedule_shutdown[0].data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "cloudwatch:EnableAlarmActions",
                              + "cloudwatch:DisableAlarmActions",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:cloudwatch:ca-central-1:257394494478:alarm:load-balancer-unhealthy-hosts",
                              + "arn:aws:cloudwatch:ca-central-1:257394494478:alarm:load-balancer-response-time",
                              + "arn:aws:cloudwatch:ca-central-1:257394494478:alarm:load-balancer-healthy-hosts",
                            ]
                          + Sid      = "EnableDisableCloudWatchAlarms"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "ecs:UpdateService"
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:ecs:ca-central-1:257394494478:service/superset/superset",
                              + "arn:aws:ecs:ca-central-1:257394494478:service/superset/celery-worker",
                              + "arn:aws:ecs:ca-central-1:257394494478:service/superset/celery-beat",
                            ]
                          + Sid      = "UpdateECSServices"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + null,
          + null,
        ]
    }

  # module.schedule_shutdown[0].aws_cloudwatch_event_rule.schedule["shutdown"] will be created
  + resource "aws_cloudwatch_event_rule" "schedule" {
      + arn                 = (known after apply)
      + description         = "Resource shutdown at 'cron(0 22 * * ? *)'"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "schedule-shutdown-shutdown"
      + name_prefix         = (known after apply)
      + region              = "ca-central-1"
      + schedule_expression = "cron(0 22 * * ? *)"
      + tags                = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
    }

  # module.schedule_shutdown[0].aws_cloudwatch_event_rule.schedule["startup"] will be created
  + resource "aws_cloudwatch_event_rule" "schedule" {
      + arn                 = (known after apply)
      + description         = "Resource startup at 'cron(0 10 ? * MON-FRI *)'"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "schedule-shutdown-startup"
      + name_prefix         = (known after apply)
      + region              = "ca-central-1"
      + schedule_expression = "cron(0 10 ? * MON-FRI *)"
      + tags                = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
    }

  # module.schedule_shutdown[0].aws_cloudwatch_event_target.schedule["shutdown"] will be created
  + resource "aws_cloudwatch_event_target" "schedule" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + action = "shutdown"
            }
        )
      + region         = "ca-central-1"
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.schedule_shutdown[0].aws_cloudwatch_event_target.schedule["startup"] will be created
  + resource "aws_cloudwatch_event_target" "schedule" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + action = "startup"
            }
        )
      + region         = "ca-central-1"
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.schedule_shutdown[0].aws_cloudwatch_log_group.schedule will be created
  + resource "aws_cloudwatch_log_group" "schedule" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/schedule-shutdown"
      + name_prefix                 = (known after apply)
      + region                      = "ca-central-1"
      + retention_in_days           = 14
      + skip_destroy                = false
      + tags                        = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
    }

  # module.schedule_shutdown[0].aws_iam_policy.schedule will be created
  + resource "aws_iam_policy" "schedule" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "schedule-shutdown-lambda"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
    }

  # module.schedule_shutdown[0].aws_iam_role.schedule will be created
  + resource "aws_iam_role" "schedule" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "schedule-shutdown-lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.schedule_shutdown[0].aws_iam_role_policy_attachment.schedule will be created
  + resource "aws_iam_role_policy_attachment" "schedule" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "schedule-shutdown-lambda"
    }

  # module.schedule_shutdown[0].aws_lambda_function.schedule will be created
  + resource "aws_lambda_function" "schedule" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Lambda function to schedule resource shutdown and startup"
      + filename                       = "/tmp/schedule.py.zip"
      + function_name                  = "schedule-shutdown"
      + handler                        = "schedule.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ca-central-1"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "python3.13"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "tlVwO7V9RKwpxk+J6NIfb27OK3qJNXF08i+C/vGeW8k="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CLOUDWATCH_ALARM_ARNS"    = "arn:aws:cloudwatch:ca-central-1:257394494478:alarm:load-balancer-unhealthy-hosts,arn:aws:cloudwatch:ca-central-1:257394494478:alarm:load-balancer-healthy-hosts,arn:aws:cloudwatch:ca-central-1:257394494478:alarm:load-balancer-response-time"
              + "ECS_SERVICE_ARNS"         = "arn:aws:ecs:ca-central-1:257394494478:service/superset/superset,arn:aws:ecs:ca-central-1:257394494478:service/superset/celery-worker,arn:aws:ecs:ca-central-1:257394494478:service/superset/celery-beat"
              + "RDS_CLUSTER_ARNS"         = null
              + "ROUTE53_HEALTHCHECK_ARNS" = null
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.schedule_shutdown[0].aws_lambda_permission.schedule["shutdown"] will be created
  + resource "aws_lambda_permission" "schedule" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "schedule-shutdown"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "ca-central-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromCloudWatch-shutdown"
      + statement_id_prefix = (known after apply)
    }

  # module.schedule_shutdown[0].aws_lambda_permission.schedule["startup"] will be created
  + resource "aws_lambda_permission" "schedule" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "schedule-shutdown"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "ca-central-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromCloudWatch-startup"
      + statement_id_prefix = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/athena_access_logs/athena_access_logs/locals.tf line 6, in locals:
   6:   region     = data.aws_region.current.name

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 14 more similar warnings elsewhere)

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

server_side_encryption_configuration is deprecated. Use the
aws_s3_bucket_server_side_encryption_configuration resource instead.

(and 9 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake[\"production\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake[\"staging\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ses_bounce_rate_high"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ses_complaint_rate_high"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset_cache"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.superset_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.superset_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.label_sizerestrictions_body_excluded_paths"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_ssm_parameter.sentinel_forwarder_auth"]

34 tests, 19 passed, 15 warnings, 0 failures, 0 exceptions

```

</details>
